20230123184356-generics.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-07 Sat 17:54 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Generics</title>
<meta name="author" content="Michael Leibbrandt" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Generics</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org62cd864">1. Example</a></li>
<li><a href="#org5e77202">2. Autoboxing</a></li>
<li><a href="#org075a41f">3. Unboxing</a></li>
<li><a href="#org8f38696">4. Constraints</a></li>
<li><a href="#orgd84a2ee">5. Type Erasue</a></li>
<li><a href="#org95389c6">6. Generic Methods</a></li>
<li><a href="#org456988f">7. Multiple Type Paramters</a></li>
<li><a href="#org80ffd10">8. Generic Wildcards</a></li>
</ul>
</div>
</div>
<p>
:ID:       ba915d24-80bf-4d9c-951a-351da356e216
</p>
<p>
#+auto<sub>tangle</sub> t
</p>

<div id="outline-container-org62cd864" class="outline-2">
<h2 id="org62cd864"><span class="section-number-2">1.</span> Example</h2>
<div class="outline-text-2" id="text-1">
<p>
<code>GenericList.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">GenericList</span>&lt;<span class="org-type">T</span>&gt; {
    <span class="org-keyword">private</span> <span class="org-type">T</span>[] <span class="org-variable-name">items</span> = (<span class="org-type">T</span>[]) <span class="org-keyword">new</span> <span class="org-type">Object</span>[10];
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">count</span>;

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">add</span>(<span class="org-type">T</span> <span class="org-variable-name">item</span>) {
        items[count++] = item;
    }

    <span class="org-keyword">public</span> <span class="org-type">T</span> <span class="org-function-name">get</span>(<span class="org-type">int</span> <span class="org-variable-name">index</span>) {
        <span class="org-keyword">return</span> items[index];
    }
}
</pre>
</div>

<p>
<code>Main.java</code>
</p>
<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">Main</span> {
    <span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
       <span class="org-type">var</span> <span class="org-variable-name">stringList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;<span class="org-type">String</span>&gt;();
       stringList.add(<span class="org-string">"DeadPool"</span>);
       stringList.add(<span class="org-string">"Batman"</span>);
       System.out.println(stringList.get(1));
       <span class="org-type">var</span> <span class="org-variable-name">numList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;<span class="org-type">Integer</span>&gt;();
       numList.add(69);
       numList.add(420);
       System.out.println(numList.get(0));
    }
}
</pre>
</div>

<p>
OR
</p>
</div>
</div>

<div id="outline-container-org5e77202" class="outline-2">
<h2 id="org5e77202"><span class="section-number-2">2.</span> Autoboxing</h2>
<div class="outline-text-2" id="text-2">
<p>
Automatic conversion that the Java compiler makes between the <code>primitive types</code> and their corresponding object <code>wrapper classes</code>.
</p>

<p>
Can't store primitive values (float, int, boolean etc.) you <b>need</b> to use the Wrapper reference type (Float, Integer, Boolean).
<code>numList.add(1);</code> // Takes in an <b>Instance</b> of Integer, but we can pass in a primitive integer (1 in this case).
Java compiler puts integer value inside a <code>box</code>.
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
  <span class="org-type">GenericList</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">stringList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;&gt;(); <span class="org-comment-delimiter">// </span><span class="org-comment">No need for unnecessary second Wrapper reference &lt;String&gt;
</span>  <span class="org-type">GenericList</span>&lt;<span class="org-type">Integer</span>&gt; <span class="org-variable-name">numList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;&gt;();
  numList.add(1); <span class="org-comment-delimiter">// </span><span class="org-comment">Boxing
</span>  <span class="org-type">var</span> <span class="org-variable-name">number</span> = numList.get(0); <span class="org-comment-delimiter">// </span><span class="org-comment">Unboxing
</span>}
</pre>
</div>
</div>
</div>


<div id="outline-container-org075a41f" class="outline-2">
<h2 id="org075a41f"><span class="section-number-2">3.</span> Unboxing</h2>
<div class="outline-text-2" id="text-3">
<p>
Converts Wrapper reference into integer
<code>var number = numList.get(0);</code> Returns an `Instance` of the Integer class stored in a primitive Integer (Extracts value which is  stored in that Integer object).
</p>
</div>
</div>

<div id="outline-container-org8f38696" class="outline-2">
<h2 id="org8f38696"><span class="section-number-2">4.</span> Constraints</h2>
<div class="outline-text-2" id="text-4">
<p>
Here we are constraining our Generic Class to only allow instances of <code>Number</code> (String won't work)
</p>

<p>
Note: <code>&lt;T extends Number&gt;</code> is called a <b>Bounded Type paramater</b>
</p>

<div class="org-src-container">
<pre class="src src-java"><span class="org-comment-delimiter">// </span><span class="org-comment">GenericList.java
</span><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">GenericList</span>&lt;<span class="org-type">T</span> <span class="org-keyword">extends</span> <span class="org-type">Number</span>&gt; {
    <span class="org-keyword">private</span> <span class="org-type">T</span>[] <span class="org-variable-name">items</span> = (<span class="org-type">T</span>[]) <span class="org-keyword">new</span> <span class="org-type">Object</span>[10];
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">count</span>;

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">add</span>(<span class="org-type">T</span> <span class="org-variable-name">item</span>) {
        items[count++] = item;
    }

    <span class="org-keyword">public</span> <span class="org-type">T</span> <span class="org-function-name">get</span>(<span class="org-type">int</span> <span class="org-variable-name">index</span>) {
        <span class="org-keyword">return</span> items[index];
    }
}
<span class="org-comment-delimiter">// </span><span class="org-comment">Main.java
</span><span class="org-keyword">public</span> <span class="org-keyword">static</span> <span class="org-type">void</span> <span class="org-function-name">main</span>(<span class="org-type">String</span>[] <span class="org-variable-name">args</span>) {
    <span class="org-type">GenericList</span>&lt;<span class="org-type">String</span>&gt; <span class="org-variable-name">stringList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;&gt;(); <span class="org-comment-delimiter">// </span><span class="org-comment">Compilation Error
</span>    <span class="org-type">GenericList</span>&lt;<span class="org-type">Integer</span>&gt; <span class="org-variable-name">numList</span> = <span class="org-keyword">new</span> <span class="org-type">GenericList</span>&lt;&gt;();  <span class="org-comment-delimiter">// </span><span class="org-comment">Okay
</span>}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-java"><span class="org-keyword">public</span> <span class="org-keyword">class</span> <span class="org-type">GenericList</span>&lt;<span class="org-type">T</span> <span class="org-keyword">extends</span> <span class="org-type">Comparable</span> &amp; <span class="org-type">Cloneable</span>&gt; {
    <span class="org-keyword">private</span> <span class="org-type">T</span>[] <span class="org-variable-name">items</span> = (<span class="org-type">T</span>[]) <span class="org-keyword">new</span> <span class="org-type">Object</span>[10];
    <span class="org-keyword">private</span> <span class="org-type">int</span> <span class="org-variable-name">count</span>;

    <span class="org-keyword">public</span> <span class="org-type">void</span> <span class="org-function-name">add</span>(<span class="org-type">T</span> <span class="org-variable-name">item</span>) {
        items[count++] = item;
    }

    <span class="org-keyword">public</span> <span class="org-type">T</span> <span class="org-function-name">get</span>(<span class="org-type">int</span> <span class="org-variable-name">index</span>) {
        <span class="org-keyword">return</span> items[index];
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd84a2ee" class="outline-2">
<h2 id="orgd84a2ee"><span class="section-number-2">5.</span> Type Erasue</h2>
<div class="outline-text-2" id="text-5">
<p>
When we have multiple interface constraints,  i.e.: <code>GenericList&lt;T extends Comparable &amp; Cloneable&gt;</code> , Java Compiler will take the <b>Left Most</b>  (in this case <code>Comparable</code>) Type to replace all <code>T</code> (Erases all type paramaters and replaces with Class/Interface pending on constraints).
If there are no constraints, all (generic) <code>T</code> will be replaced by <code>Object</code> class.
</p>

<p>
Oracle definition:
</p>
<ul class="org-ul">
<li>Replace all type parameters in generic types with their bounds or Object if the type parameters are unbounded. The produced bytecode, therefore, contains only ordinary classes, interfaces, and methods.</li>
<li>Insert type casts if necessary to preserve type safety.</li>
<li>Generate bridge methods to preserve polymorphism in extended generic types.</li>
</ul>

<p>
See <a href="20230125085040-comparable_interface.html#ID-978e88bf-bfac-4a29-a851-048441593c54">Comparable Interface</a>
</p>
</div>
</div>

<div id="outline-container-org95389c6" class="outline-2">
<h2 id="org95389c6"><span class="section-number-2">6.</span> <a href="20230125085439-generic_methods.html#ID-da34a311-c25d-4d96-accf-60b35cf11cb7">Generic Methods</a></h2>
</div>

<div id="outline-container-org456988f" class="outline-2">
<h2 id="org456988f"><span class="section-number-2">7.</span> <a href="20230125090226-multiple_type_paramters.html#ID-80ca3273-689f-425e-8fbb-b60fa157368b">Multiple Type Paramters</a></h2>
</div>

<div id="outline-container-org80ffd10" class="outline-2">
<h2 id="org80ffd10"><span class="section-number-2">8.</span> <a href="20230125091828-generic_wildcards.html#ID-ffe1e06a-8d8c-4e7f-87ce-c017aec04fd2">Generic Wildcards</a></h2>
</div>
</div>
</body>
</html>
